/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package client;

/**
 * @author PlayDK
 */
public enum MapleJob {

    新手(0),
    战士(100),
    剑客(110), 勇士(111), 英雄(112),
    准骑士(120), 骑士(121), 圣骑士(122),
    枪战士(130), 龙骑士(131), 黑骑士(132),
    魔法师(200),
    火毒法师(210), 火毒巫师(211), 火毒魔导师(212),
    冰雷法师(220), 冰雷巫师(221), 冰雷魔导师(222),
    牧师(230), 祭祀(231), 主教(232),
    弓箭手(300),
    猎人(310), 射手(311), 神射手(312),
    弩弓手(320), 游侠(321), 箭神(322),
    飞侠(400),
    刺客(410), 无影人(411), 隐士(412),
    侠客(420), 独行客(421), 侠盗(422),
    见习刀客(430),
    双刀客(431), 双刀侠(432), 血刀(433), 暗影双刀(434),
    海盗(500), 海盗炮手(501),
    拳手(510), 斗士(511), 冲锋队长(512),
    火枪手(520), 大副(521), 船长(522),
    火炮手(530), 毁灭炮手(531), 神炮王(532),
    龙的传人1转(508), 龙的传人2转(570), 龙的传人3转(571), 龙的传人4转(572),
    海盗作废(509),
    拳手作废(580), 斗士作废(581), 冲锋队长作废(582),
    火枪手作废(590), 大副作废(591), 船长作废(592),
    管理者(800), 管理员(900),
    // 骑士团
    初心者(1000),
    魂骑士1转(1100), 魂骑士2转(1110), 魂骑士3转(1111), 魂骑士4转(1112),
    炎术士1转(1200), 炎术士2转(1210), 炎术士3转(1211), 炎术士4转(1212),
    风灵使者1转(1300), 风灵使者2转(1310), 风灵使者3转(1311), 风灵使者4转(1312),
    夜行者1转(1400), 夜行者2转(1410), 夜行者3转(1411), 夜行者4转(1412),
    奇袭者1转(1500), 奇袭者2转(1510), 奇袭者3转(1511), 奇袭者4转(1512),
    // 战神
    战童(2000),
    战神1转(2100), 战神2转(2110), 战神3转(2111), 战神4转(2112),
    // 龙神
    小不点(2001),
    龙神1转(2200), 龙神2转(2210), 龙神3转(2211), 龙神4转(2212), 龙神5转(2213), 龙神6转(2214), 龙神7转(2215), 龙神8转(2216), 龙神9转(2217), 龙神10转(2218),
    //双弩
    双弩精灵(2002),
    双弩精灵1转(2300), 双弩精灵2转(2310), 双弩精灵3转(2311), 双弩精灵4转(2312),
    //幻影
    幻影(2003),
    幻影1转(2400), 幻影2转(2410), 幻影3转(2411), 幻影4转(2412),
    //夜光
    夜光(2004),
    夜光1转(2700), 夜光2转(2710), 夜光3转(2711), 夜光4转(2712),
    //反抗者
    预备兵(3000), 恶魔猎手(3001), 尖兵新手(3002),
    恶魔猎手1转(3100), 恶魔猎手2转(3110), 恶魔猎手3转(3111), 恶魔猎手4转(3112),
    恶魔复仇者1转(3101), 恶魔复仇者2转(3120), 恶魔复仇者3转(3121), 恶魔复仇者4转(3122),
    幻灵斗师1转(3200), 幻灵斗师2转(3210), 幻灵斗师3转(3211), 幻灵斗师4转(3212),
    弩豹游侠1转(3300), 弩豹游侠2转(3310), 弩豹游侠3转(3311), 弩豹游侠4转(3312),
    机械师1转(3500), 机械师2转(3510), 机械师3转(3511), 机械师4转(3512),
    尖兵1转(3600), 尖兵2转(3610), 尖兵3转(3611), 尖兵4转(3612),
    //米哈尔
    无名少年(5000),
    米哈尔1转(5100), 米哈尔2转(5110), 米哈尔3转(5111), 米哈尔4转(5112),
    //狂龙战士
    狂龙战士(6000),
    狂龙战士1转(6100), 狂龙战士2转(6110), 狂龙战士3转(6111), 狂龙战士4转(6112),
    //爆莉萌天使
    爆莉萌天使(6001),
    爆莉萌天使1转(6500), 爆莉萌天使2转(6510), 爆莉萌天使3转(6511), 爆莉萌天使4转(6512),
    //神之子
    神之子(10000),
    神之子_1(10100), 神之子_2(10110), 神之子_3(10111), 神之子_4(10112),
    //林之灵
    林之灵(11000),
    林之灵_1(11200), 林之灵_2(11210), 林之灵_3(11211), 林之灵_4(11212);
    private final int jobid;

    MapleJob(int id) {
        this.jobid = id;
    }

    public static String getName(MapleJob basejob) {
        return basejob.name();
    }

    public static MapleJob getById(int id) {
        for (MapleJob l : values()) {
            if (l.getId() == id) {
                return l;
            }
        }
        return null;
    }

    public static boolean isExist(int id) {
        for (MapleJob job : values()) {
            if (job.getId() == id) {
                return true;
            }
        }
        return false;
    }

    public int getId() {
        return jobid;
    }
}
