package constants;

public class MapConstants {

    public static boolean isStartingEventMap(final int mapid) {
        switch (mapid) {
            case 109010000: //冒险岛活动 - 寻找宝物
            case 109020001: //冒险岛活动 - OX问答
            case 109030001: //冒险岛活动 - 上楼~上楼~&lt;第1阶段>
            case 109030101: //冒险岛活动 - 上楼~上楼~&lt;第1阶段>
            case 109030201: //冒险岛活动 - 上楼~上楼~&lt;第1阶段>
            case 109030301: //冒险岛活动 - 上楼~上楼~&lt;第1阶段>
            case 109030401: //冒险岛活动 - 上楼~上楼~&lt;第1阶段>
            case 109040000: //冒险岛活动 - 向高地&lt;待机室>
            case 109060001: //冒险岛活动 - 活动地图入口
            case 109060002: //隐藏地图 - 活动地图入口
            case 109060003: //冒险岛活动 - 活动地图入口
            case 109060004: //冒险岛活动 - 雪球赛&lt;2阶段>
            case 109060005: //冒险岛活动 - 活动地图入口
            case 109060006: //
            case 109080000: //冒险岛活动 - 椰子比赛
            case 109080001: //冒险岛活动 - 椰子比赛
            case 109080002: //冒险岛活动 - 椰子比赛
            case 109080003: //冒险岛活动 - G★椰子比赛
                return true;
        }
        return false;
    }

    public static boolean isEventMap(final int mapid) {
        return (mapid >= 109010000 && mapid < 109050000) || (mapid > 109050001 && mapid < 109090000) || (mapid >= 809040000 && mapid <= 809040100);
    }

    public static boolean isCoconutMap(final int mapid) {
        return mapid == 109080000 || mapid == 109080001 || mapid == 109080002 || mapid == 109080003 || mapid == 109080010 || mapid == 109080011 || mapid == 109080012 || mapid == 109090300 || mapid == 109090301 || mapid == 109090302 || mapid == 109090303 || mapid == 109090304 || mapid == 910040100;
    }


    public static boolean isBossMap(int mapid) {
        switch (mapid) {
            case 0: //BUG地图 是个小黑屋
            case 105100400: //蝙蝠怪神殿 - 蝙蝠怪的墓地
            case 105100300: //蝙蝠怪神殿 - 蝙蝠怪的墓地
            case 280030000: //神秘岛 - 扎昆的祭台
            case 280030100: //最后的任务 - 扎昆的祭台
            case 280030001: //最后的任务 - 进阶扎昆的祭台
            case 240040700: //神木村 - 生命之穴入口
            case 240060200: //生命之穴 - 暗黑龙王洞穴
            case 240060201: //生命之穴 - 进阶暗黑龙王洞穴
            case 270050100: //神殿的深处 - 神的黄昏
            case 802000111: //逆奥之城 - 卡姆那 (远征队)
            case 802000211: //逆奥之城 - 防御塔 2100年 (远征队)
            case 802000311: //逆奥之城 - 公园 2095年 (远征队)
            case 802000411: //逆奥之城 - 高科区域 2102年 (远征队)
            case 802000611: //逆奥之城 - 天空大战舰甲板 2102年 (远征队)
            case 802000711: //逆奥之城 - 核心商业区 2102年（远征队）
            case 802000801: //逆奥之城 - 商贸中心 2102年(大厅)
            case 802000802: //逆奥之城 - 商贸中心 2102年(升降机井)
            case 802000803: //逆奥之城 - 商贸中心 2102年(入口)
            case 802000821: //逆奥之城 - 商贸中心顶楼 2102年（远征队）
            case 802000823: //逆奥之城 - 商贸中心顶楼 2102年（远征队）
            case 211070100: //狮子王之城 - 接见室
            case 211070101: //狮子王之城 - 空中监狱
            case 211070110: //狮子王之城 - 复活塔楼
            case 551030200: //马来西亚 - 阴森世界
            case 271040100: //骑士团要塞 - 希纳斯的殿堂
            case 271040200: //骑士团要塞 - 希纳斯的后院
            case 300030310: //艾琳森林 - 女王藏身处
            case 220080001: //玩具城 - 时间塔的本源
                return true;
            default:
                return false;
        }
    }
}
